export const helpString = `כדי שאדע שאתם מדברים אלי, תזכירו אותי בהודעה שלכם, תוסיפו את השם שלי
@SuperPony.

הנה רשימת הפקודות שאני יודע לבצע:
1. להציג את כל הטיקרים שבמעקב בחוכמת הסורק – כתבו: טיקרים
   לדוגמה: @SuperPony טיקרים

2. להציג את כל הטיקרים שבמעקב שאתם ציינתם ראשונים החודש – כתבו: טיקרים שלי
   לדוגמה: @SuperPony טיקרים שלי
   או: @SuperPony שלי

3. להציג את כל הטיקרים של חברות שמדווחות היום – כתבו: דיווחים או מדווחות
   לדוגמה: @SuperPony דיווחים
   או: @SuperPony מדווחות

4. להציג תמונה של החברות שהכי מצפים לדיווח שלהן היום – כתבו: תמונת דיווחים או תמונה
   לדוגמה: @SuperPony תמונת דיווחים
   או: @SuperPony תמונה

5. להציג את הטיקרים של חברות ה־סאפ 500 שמדווחות היום – כתבו: דיווחים 500
   לדוגמה: @SuperPony דיווחים 500

יש גם פקודת סלאש:
להציג את כל הדיווחים של היום, עם אפשרות לסנן לפי סוג או מספר תוצאות.
/todays_earnings  (type: All | S&P 500 | Anticipated, limit: #)

/atr - מחשב את ה־ATR (Average True Range) של טיקר מסוים במשך מספר ימים נתון.
לדוגמה:
  /atr AAPL
אפשר גם לציין את מספר הימים, למשל:
  /atr AAPL 14
ויש גם אפשרות לציין את סוג הטווחף יומי, שבועי או חודשי:
   /atr AAPL 14 daily
   /atr AAPL 14 weekly
   /atr AAPL 14 monthly  

--------------------
ויש גם פקודות הזמינות לניהול סקר התשואה החודשי:
- \`/start_survey\` - פותח חלון הזנה חדש בסקר התשואה החודשי
- \`/remind_survey\` - שולח תזכורת למשתמשים להשתתף בסקר
- \`/publish_survey\` - מסכם את התשואות שהתקבלו ומפרסם את התוצאות
הפקודות הללו זמינות רק למשתמשים עם תפקיד "admin".

`;

export async function sendHelp({ channel }) {
  await channel.send(helpString);
}
